# CannotPutELAInOption Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DesignOptionFailures..::..CannotPutELAInOption Property
BuiltInFailures..::..DesignOptionFailures Class See Also
---
Electrical Load Areas must be in the Main Model.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotPutELAInOption { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotPutELAInOption As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotPutELAInOption {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DesignOptionFailures Class
Autodesk.Revit.DB Namespace